Revit 2024 API
StairsType.RightSideSupportType Property
 The type of right support used in the stair.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId RightSideSupportType { get; set; }
Visual Basic
Public Property RightSideSupportType As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ RightSideSupportType {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: rightSideStringerTypeId is not a valid support type. -or- When setting this property: The specified rightSideStringerTypeId doesn't match the desired style of the right side support.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The right support style is none, so this related data cannot be set.
See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace